# Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей. Дано a, b, c —
# стороны предполагаемого треугольника. Требуется сравнить длину каждого отрезка-стороны с суммой
# двух других. Если хотя бы в одном случае отрезок окажется больше суммы двух других, то треугольника
# с такими сторонами не существует. Отдельно сообщить является ли треугольник разносторонним,
# равнобедренным или равносторонним.

a = int(input("Введите длину стороны a : "))
b = int(input("Введите длину стороны b : "))
c = int(input("Введите длину стороны c : "))
if a > (b + c) or b > (a + c) or c > (a + b):
        print("Треугольника не существует")
elif a == b == c:
        print(" Треугольник - Равносторонний ")
elif a != b != c:
        print(" Треугольник - Разносторонний ")
elif a == b or b == c or c == a:
        print(" Треугольник - Равнобедренный ")

if a < (b + c) and b < (a + c) and c < (a + b):
    if a == b == c:
        print(" Треугольник - Равносторонний ")
        exit()
    if a == b or b == c or c == a:
        print(" Треугольник - Равнобедренный ")
        exit()
    print(" Треугольник - Разносторонний ")
else:
    print("Треугольника не существует")

