# a = int(input(" Введите переменную:  a  "))
# b = int(input(" Введите переменную:  b  "))
# c = int(input(" Введите переменную:  c  "))
# print(a, b, c)
#
# d = b * b - 4 * (a * c)
# print(d)
# if d < 0:
#     print(f'Корней нет, но Дискриминант есть, но он меньше ноля: d = {d}')
# if d == 0:
#     print(" Корень есть но один )))")
#     x = - b / (2 * a)
#     print(f' a = {a}, b  = {b}, c = {c}, d = {d}, x = {x}')
# if d > 0:
#     print(" Корень есть И даже два поздравляю )))")
#     x1 = (-b + d ** (1/2))/(2 * a)
#     x2 = (-b - d ** (1 / 2)) / (2 * a)
#     print(f' a = {a}, b  = {b}, c = {c}, d = {d}, x1 = {x1}, x2 = {x2}')

